Enums/ОбъектыЗадач.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ОбъектыЗадач</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВедущийКонструктор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДополнитьКартуПроектаДиз</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДополнитьКартуПроектаКон</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаполнениеДлительностиПроизводства</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаполненияДлительностиМонтажа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодготовитьОзнакомительныйВыезд</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроверятьГабаритныеЧерчежи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РуководительЗамера</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СоздатьЗапускВРаботу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СоздатьКартуПроектаДиз</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СоздатьКартуПроектаКон</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/НазначениеАвтораДляЗадачи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>НазначениеАвтораДляЗадачи</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектЗадачи</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ОбъектыЗадач</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Продолжительность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сортировка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/омЗадачи/Ext/Module.bsl
Процедура СоздатьЗадачуНаСозданиеГабаритногоЧеритежа(Проект, ГабаритныйЧертеж, КрайняяДатаИсполнения = Неопределено) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СоздатьМодельГабаритногоЧертежа.Ссылка КАК СоздатьМодельГабаритногоЧертежа
		|ИЗ
		|	Задача.СоздатьМодельГабаритногоЧертежа КАК СоздатьМодельГабаритногоЧертежа
		|ГДЕ
		|	СоздатьМодельГабаритногоЧертежа.ГабаритныйЧертеж = &ГабаритныйЧертеж";
	
	Запрос.УстановитьПараметр("ГабаритныйЧертеж", ГабаритныйЧертеж);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл

		Если ЗначениеЗаполнено(Выборка.СоздатьМодельГабаритногоЧертежа) Тогда
			Возврат;
		КонецЕсли;
		
	КонецЦикла;
	
	Исполнитель = Справочники.НазначениеАвтораДляЗадачи.ПолучитьАвтораДляЗадачи(Проект, Перечисления.ОбъектыЗадач.ПроверятьГабаритныеЧерчежи);
	
	НоваяЗадача 						= Задачи.СоздатьМодельГабаритногоЧертежа.СоздатьЗадачу();
	НоваяЗадача.ГабаритныйЧертеж 		= ГабаритныйЧертеж;
	НоваяЗадача.Дата 					= ТекущаяДата();
	НоваяЗадача.Исполнитель 			= Исполнитель;
	НоваяЗадача.Проект 					= ГабаритныйЧертеж.Проект;
	НоваяЗадача.КрайняяДатаИсполнения 	= КрайняяДатаИсполнения;
	НоваяЗадача.Наименование 			= Строка(ГабаритныйЧертеж) + ".Создание";
	
	НоваяЗадача.Записать();
	
КонецПроцедуры

Функция ПолучитьИсполнителя(ОбъектЗадачи = Неопределено, ТолькоПервый = Истина) Экспорт
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НазначениеАвтораДляЗадачи.Исполнитель КАК Исполнитель,
		|	НазначениеАвтораДляЗадачи.ОбъектЗадачи КАК ОбъектЗадачи
		|ИЗ
		|	Справочник.НазначениеАвтораДляЗадачи КАК НазначениеАвтораДляЗадачи
		|ГДЕ
		|	ВЫБОР
		|			КОГДА НазначениеАвтораДляЗадачи.ОбъектЗадачи = НЕОПРЕДЕЛЕНО
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ НазначениеАвтораДляЗадачи.ОбъектЗадачи = &ОбъектЗадачи
		|		КОНЕЦ
		|	И НЕ НазначениеАвтораДляЗадачи.ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	НазначениеАвтораДляЗадачи.ОбъектЗадачи,
		|	НазначениеАвтораДляЗадачи.Сортировка";
	
	Запрос.УстановитьПараметр("ОбъектЗадачи", ОбъектЗадачи);
	
	
	Если ТолькоПервый ИЛИ НЕ ОбъектЗадачи = Неопределено Тогда
		              
		мИсполнители = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Исполнитель");
		
		Если ТолькоПервый Тогда
			Если мИсполнители.Количество() = 0 Тогда
			
				Возврат Справочники.Пользователи.ПустаяСсылка();	
			
			Иначе
			
				Возврат мИсполнители[0];	
			
			КонецЕсли;
		
		Иначе
		
			Возврат мИсполнители;	
		
		КонецЕсли;
	
	Иначе 
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		соИсполнители = Новый Соответствие;
		
		текОбъектЗадачи = Неопределено;
		мИсполнители 	= Неопределено;
		
		Пока Выборка.Следующий() Цикл
			
			Если НЕ текОбъектЗадачи = Выборка.ОбъектЗадачи Тогда
				
				Если НЕ текОбъектЗадачи = Неопределено Тогда
					соИсполнители.Вставить(текОбъектЗадачи, мИсполнители);	
				КонецЕсли;	
				
			    мИсполнители = Новый Массив;
			КонецЕсли;
			
			мИсполнители.Добавить(Выборка.Исполнитель);
			
		КонецЦикла;
		
		Если НЕ текОбъектЗадачи = Неопределено Тогда
			соИсполнители.Вставить(текОбъектЗадачи, мИсполнители);	
		КонецЕсли;	
		
		Возврат соИсполнители;
		
	КонецЕсли;
	
КонецФункции // ПолучитьИсполнителя()

Функция ЕстьЗакрытаяЗадачаРКД(ОбъектТЗ) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Задачи_РКД.Ссылка КАК Ссылка
		|ИЗ
		|	Задача.Задачи_РКД КАК Задачи_РКД
		|ГДЕ
		|	Задачи_РКД.ОбъектТЗ = &ОбъектТЗ
		|	И Задачи_РКД.Выполнена";
	
	Запрос.УстановитьПараметр("ОбъектТЗ", ОбъектТЗ);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Ссылка;
	КонецЦикла;

	Возврат Задачи.Задачи_РКД.ПустаяСсылка();
	
КонецФункции // ЕстьЗакрытаяЗадачаРКД()
